Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz4010ca80144.h
#define PIN_PC19M_GCLK_IO1                         _UINT32_(83)
#define MUX_PC19M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PC19M_GCLK_IO1                      ((PIN_PC19M_GCLK_IO1 << 16) | MUX_PC19M_GCLK_IO1)
#define PORT_PC19M_GCLK_IO1                        (_UINT32_(1) << 19)

#define PIN_PD00M_GCLK_IO2                         _UINT32_(96)
#define MUX_PD00M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PD00M_GCLK_IO2                      ((PIN_PD00M_GCLK_IO2 << 16) | MUX_PD00M_GCLK_IO2)
#define PORT_PD00M_GCLK_IO2                        (_UINT32_(1) << 0)

#define PIN_PD01M_GCLK_IO3                         _UINT32_(97)
#define MUX_PD01M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PD01M_GCLK_IO3                      ((PIN_PD01M_GCLK_IO3 << 16) | MUX_PD01M_GCLK_IO3)
#define PORT_PD01M_GCLK_IO3                        (_UINT32_(1) << 1)

#define PIN_PC00M_GCLK_IO4                         _UINT32_(64)
#define MUX_PC00M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PC00M_GCLK_IO4                      ((PIN_PC00M_GCLK_IO4 << 16) | MUX_PC00M_GCLK_IO4)
#define PORT_PC00M_GCLK_IO4                        (_UINT32_(1) << 0)

#define PIN_PD18M_GCLK_IO4                         _UINT32_(114)
#define MUX_PD18M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PD18M_GCLK_IO4                      ((PIN_PD18M_GCLK_IO4 << 16) | MUX_PD18M_GCLK_IO4)
#define PORT_PD18M_GCLK_IO4                        (_UINT32_(1) << 18)

#define PIN_PC01M_GCLK_IO5                         _UINT32_(65)
#define MUX_PC01M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PC01M_GCLK_IO5                      ((PIN_PC01M_GCLK_IO5 << 16) | MUX_PC01M_GCLK_IO5)
#define PORT_PC01M_GCLK_IO5                        (_UINT32_(1) << 1)

#define PIN_PD19M_GCLK_IO5                         _UINT32_(115)
#define MUX_PD19M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PD19M_GCLK_IO5                      ((PIN_PD19M_GCLK_IO5 << 16) | MUX_PD19M_GCLK_IO5)
#define PORT_PD19M_GCLK_IO5                        (_UINT32_(1) << 19)

#define PIN_PC02M_GCLK_IO6                         _UINT32_(66)
#define MUX_PC02M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PC02M_GCLK_IO6                      ((PIN_PC02M_GCLK_IO6 << 16) | MUX_PC02M_GCLK_IO6)
#define PORT_PC02M_GCLK_IO6                        (_UINT32_(1) << 2)

#define PIN_PD20M_GCLK_IO6                         _UINT32_(116)
#define MUX_PD20M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PD20M_GCLK_IO6                      ((PIN_PD20M_GCLK_IO6 << 16) | MUX_PD20M_GCLK_IO6)
#define PORT_PD20M_GCLK_IO6                        (_UINT32_(1) << 20)

#define PIN_PC03M_GCLK_IO7                         _UINT32_(67)
#define MUX_PC03M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PC03M_GCLK_IO7                      ((PIN_PC03M_GCLK_IO7 << 16) | MUX_PC03M_GCLK_IO7)
#define PORT_PC03M_GCLK_IO7                        (_UINT32_(1) << 3)

#define PIN_PD21M_GCLK_IO7                         _UINT32_(117)
#define MUX_PD21M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PD21M_GCLK_IO7                      ((PIN_PD21M_GCLK_IO7 << 16) | MUX_PD21M_GCLK_IO7)
#define PORT_PD21M_GCLK_IO7                        (_UINT32_(1) << 21)

#define PIN_PC04J_GCLK_spi_ixs_mclk0               _UINT32_(68)
#define MUX_PC04J_GCLK_spi_ixs_mclk0               _UINT32_(9) 
#define PINMUX_PC04J_GCLK_spi_ixs_mclk0            ((PIN_PC04J_GCLK_spi_ixs_mclk0 << 16) | MUX_PC04J_GCLK_spi_ixs_mclk0)
#define PORT_PC04J_GCLK_spi_ixs_mclk0              (_UINT32_(1) << 4)

#define PIN_PD06J_GCLK_spi_ixs_mclk0               _UINT32_(102)
#define MUX_PD06J_GCLK_spi_ixs_mclk0               _UINT32_(9) 
#define PINMUX_PD06J_GCLK_spi_ixs_mclk0            ((PIN_PD06J_GCLK_spi_ixs_mclk0 << 16) | MUX_PD06J_GCLK_spi_ixs_mclk0)
#define PORT_PD06J_GCLK_spi_ixs_mclk0              (_UINT32_(1) << 6)

/* ========== PORT definition for MLB peripheral ========== */
#define PIN_PD07G_MLB_MLBC                         _UINT32_(103)
#define MUX_PD07G_MLB_MLBC                         _UINT32_(6) 
#define PINMUX_PD07G_MLB_MLBC                      ((PIN_PD07G_MLB_MLBC << 16) | MUX_PD07G_MLB_MLBC)
#define PORT_PD07G_MLB_MLBC                        (_UINT32_(1) << 7)

#define PIN_PD09G_MLB_MLBD                         _UINT32_(105)
#define MUX_PD09G_MLB_MLBD                         _UINT32_(6) 
#define PINMUX_PD09G_MLB_MLBD                      ((PIN_PD09G_MLB_MLBD << 16) | MUX_PD09G_MLB_MLBD)
#define PORT_PD09G_MLB_MLBD                        (_UINT32_(1) << 9)

#define PIN_PD08G_MLB_MLBS                         _UINT32_(104)
#define MUX_PD08G_MLB_MLBS                         _UINT32_(6) 
#define PINMUX_PD08G_MLB_MLBS                      ((PIN_PD08G_MLB_MLBS << 16) | MUX_PD08G_MLB_MLBS)
#define PORT_PD08G_MLB_MLBS                        (_UINT32_(1) << 8)

/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PB17P_PTC_DRV0                         _UINT32_(49)
#define MUX_PB17P_PTC_DRV0                         _UINT32_(15)
#define PINMUX_PB17P_PTC_DRV0                      ((PIN_PB17P_PTC_DRV0 << 16) | MUX_PB17P_PTC_DRV0)
#define PORT_PB17P_PTC_DRV0                        (_UINT32_(1) << 17)

#define PIN_PB16P_PTC_DRV1                         _UINT32_(48)
#define MUX_PB16P_PTC_DRV1                         _UINT32_(15)
#define PINMUX_PB16P_PTC_DRV1                      ((PIN_PB16P_PTC_DRV1 << 16) | MUX_PB16P_PTC_DRV1)
#define PORT_PB16P_PTC_DRV1                        (_UINT32_(1) << 16)

#define PIN_PB15P_PTC_DRV2                         _UINT32_(47)
#define MUX_PB15P_PTC_DRV2                         _UINT32_(15)
#define PINMUX_PB15P_PTC_DRV2                      ((PIN_PB15P_PTC_DRV2 << 16) | MUX_PB15P_PTC_DRV2)
#define PORT_PB15P_PTC_DRV2                        (_UINT32_(1) << 15)

#define PIN_PB14P_PTC_DRV3                         _UINT32_(46)
#define MUX_PB14P_PTC_DRV3                         _UINT32_(15)
#define PINMUX_PB14P_PTC_DRV3                      ((PIN_PB14P_PTC_DRV3 << 16) | MUX_PB14P_PTC_DRV3)
#define PORT_PB14P_PTC_DRV3                        (_UINT32_(1) << 14)

